// 2. script.js ფაილში შექმენით ცვლადები და მიანიჭეთ მარტივი ტიპები (Primitive types). გამოიყენეთ ყველა მარტივი ტიპი რაც ვისწავლეთ.

let name = "Elene";
let surname = "Khunashvili";

console.log (name + " " + surname);

/* 3. შექმენით ცვლადი, რომლის მნიშვნელობაც არის მთელი რიცხვი და წარმოადგენს წრეწირის რადიუსს. 
გამოთვალეთ და მიანიჭეთ მეორე ცვლადს ამ წრეწირის ფართობი.
გამოთვალეთ და მიანიჭეთ მესამე ცვლადს ამ წრეწირის სიგრძე.

ცვლადებს დაარქვით შესაბამისი სახელები.
*/

let	r = 20;

let S = Math.PI * r * r;

let	l = 2 * Math.PI * r;

console.log	("წრეწირის რადიუსი = " + r);
console.log	("წრეწირის ფართობი = " + S);
console.log	("წრეწირის სიგრძე = " + l);

// 4. შექმენით ორი ცვლადი და მიანიჭეთ მთელი რიცხვები. ეს რიცხვები წარმოადგენენ მართკუთხა სამკუთხედის კათეტების ზომებს.
//გამოთვალეთ ჰიპოტენუზის სიგრძე და მიანიჭეთ მესამე ცვლადს.

let x = 3;
let y = 5;

let c = Math.sqrt (x * x + y * y);

console.log ("ჰიპოტენუზა = " + c);

// 5. prompt() ფუნქციით მომხმარებელს შეაყვანინეთ კუბის წიბოს ზომა და ჩაწერეთ ცვლადში.
// გამოთვალეთ კუბის მოცულობა და დალოგეთ კონსოლში console.log ფუნქციის გამოყენებით. (მაგალითად: console.log(x))

let	a = prompt("კუბის მოცულობის გამოსათვლელად შეიყვანე წიბოს ზომა");

console.log ("კუბის მოცულობა = " + Math.pow (a, 3));